Revit 2024 API
ParameterTypeId.StairstypeConstructionMethod Property
 "Construction Method":
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId StairstypeConstructionMethod { get; }
Visual Basic
Public Shared ReadOnly Property StairstypeConstructionMethod As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ StairstypeConstructionMethod {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace